
<!DOCTYPE html>
<html>

<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>homeWork</title>
  <link rel="shortcut icon" type="image/x-icon" href="../favicon.ico">
  <link rel="stylesheet" href="https://stackedit.io/style.css" />
  <script src="https://polyfill.io/v3/polyfill.min.js?features=es6"></script>
  <script id="MathJax-script" async
    src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-mml-chtml.js">
  </script>
<style>
.fake-link {
  color: #49a8db;    /* цвет как у обычной ссылки */
  text-decoration: none;  /* убираем подчёркивание */
  cursor: pointer;   /* курсор как у ссылки */
}
</style>
</head>

<body class="stackedit">
  <div class="stackedit__html"><h1 id="Домашнее-задание.">Домашнее задание.</h1>
<blockquote>
<p>Домашнее задание для студентов курса “Основы программирования” 1 курса кафедры ИУ5 МГТУ им Н.Э. Баумана.</p>
</blockquote>
<h2 id="содержание">Содержание</h2>
<ul>
  <li><a href="#цель-работs">Цель работы</a></li>
  <li><a href="#начало-работs">Начало работы</a></li>
  <li><a href="#заданиe">Задание</a></li>
  <li><a href="#варианты-заданиi">Варианты заданий</a></li>
</ul>
<h2 id="цель-работs">Цель работы</h2>
<p>Освоение низкоуровнего программирования</p>
<h2 id="начало-работs">Начало работы</h2>
<p>Зайдите в свою локальную директорию с репозиторием для выполнения лабораторных работ. Заберите ветку с соответствующей лабораторной работой из общего репозитория (в лабораторной работе 0 был отмечен меткой upstream):</p>
<pre><code>git pull upstream
</code></pre>
<p><strong>или</strong></p>
<pre><code>git pull upstream homeWork
</code></pre>
<p>Переключитесь на ветку с домашней работой:</p>
<pre><code>git checkout homeWork
</code></pre>
<p>Свяжите ветку локального репозитория с вашим удаленным репозиторием:</p>
<pre><code>git push --set-upstream origin homeWork
</code></pre>

<h2 id="заданиe">Задание</h2>
<p>Слова текста из малых латинских букв записаны не менее чем через один пробел; текст оканчивается точкой.</p>
<p>БЕЗ ИСПОЛЬЗОВАНИЯ конструкции STRING, ПОТОКОВОГО ВВОДА/ВЫВОДА, ФУНКЦИЙ scanf()/printf():</p>
<p>    а) написать программу ввода такого текста с клавиатуры; (общий пункт для всех вариантов)</p>

<h2 id="варианты-заданиi">Варианты заданий</h2>
  <ul class="variants">
      <li><strong>Вариант 1.</strong> б) напечатать все слова, отличающиеся от последнего слова, перед печатью перенеся первую букву в конец слова.</li>
      <li><strong>Вариант 2.</strong> б) напечатать все слова, отличающиеся от последнего слова, перед печатью удалив из слова последнюю букву.</li>
      <li><strong>Вариант 3.</strong> б) напечатать все слова, отличающиеся от последнего слова, перед печатью удалив из слова все последующие вхождения первой буквы.</li>
      <li><strong>Вариант 4.</strong> б) напечатать все слова, отличающиеся от последнего слова, перед печатью удалив из слова все предыдущие вхождения последней буквы.</li>
      <li><strong>Вариант 5.</strong> б) напечатать все слова, отличающиеся от последнего слова, перед печатью оставив в слове только первые вхождения каждой буквы.</li>
      <li><strong>Вариант 6.</strong> б) напечатать все слова, отличающиеся от последнего слова, перед печатью (если слово нечетной длины) удалив его среднюю букву.</li>
      <li><strong>Вариант 7.</strong> б) напечатать все слова, отличающиеся от последнего слова, и одновременно симметричные.</li>
      <li><strong>Вариант 8.</strong> б) напечатать все слова, отличающиеся от последнего слова, в которые первая буква печатаемого слова входит в него еще только один раз.</li>
      <li><strong>Вариант 9.</strong> б) напечатать все слова, отличающиеся от последнего слова, в которых буквы упорядочены по алфавиту.</li>
      <li><strong>Вариант 10.</strong> б) напечатать все слова, отличающиеся от последнего слова, и совпадающие с начальным отрезком алфавита (a, ab, abc и т.д.).</li>
      <li><strong>Вариант 11.</strong> б) напечатать все слова, отличающиеся от последнего слова, и совпадающие с конечным отрезком алфавита (z, yz, xyz и т.д.).</li>
      <li><strong>Вариант 12.</strong> б) напечатать все слова, отличающиеся от последнего слова, и имеющие максимальную длину.</li>
      <li><strong>Вариант 13.</strong> б) напечатать все слова, отличающиеся от последнего слова, и не содержащие повторяющихся букв.</li>
      <li><strong>Вариант 14.</strong> б) напечатать все слова, отличающиеся от последнего слова, и в которые каждая буква входит не менее двух раз.</li>
      <li><strong>Вариант 15.</strong> б) напечатать все слова, отличающиеся от последнего слова, в которых гласные буквы (a, e, i, o, u, y) чередуются с согласными.</li>
      <li><strong>Вариант 16.</strong> б) напечатать слова текста в обратном порядке букв.</li>
      <li><strong>Вариант 17.</strong> б) напечатать этот текст, удалив все повторные вхождения слов.</li>
      <li><strong>Вариант 18.</strong> б) напечатать все слова, входящие в текст по одному разу.</li>
      <li><strong>Вариант 19.</strong> б) напечатать все различные слова текста, указав для каждого из них количество его вхождений в текст.</li>
      <li><strong>Вариант 20.</strong> б) напечатать слова текста в алфавитном порядке.</li>
      <li><strong>Вариант 21.</strong> б) напечатать все слова, отличающиеся от последнего слова, и совпадающие с конечным отрезком алфавита (z, yz, xyz и т.д.).</li>
      <li><strong>Вариант 22.</strong> б) напечатать все слова, отличающиеся от последнего слова, и имеющие максимальную длину.</li>
      <li><strong>Вариант 23.</strong> б) напечатать все слова, отличающиеся от последнего слова, и не содержащие повторяющихся букв.</li>
      <li><strong>Вариант 24.</strong> б) напечатать все слова, отличающиеся от последнего слова, и в которые каждая буква входит не менее двух раз.</li>
      <li><strong>Вариант 25.</strong> б) напечатать все слова, отличающиеся от последнего слова, в которых гласные буквы (a, e, i, o, u, y) чередуются с согласными.</li>
    </ul>
</body>
</html>
